#language: ru
  Функционал: заказ еды на сайте Чайхоны №1

    Сценарий: выбор товаров, проверка и очистка Корзины

      Когда открыто меню Доставки
      И выбран раздел Меню Доставки "Бургеры и Шаурма"
      И заказан товар "Шаурма с курицей"
      И заказан товар "Шаурма с телятиной"
      И открыто меню Доставки
      И выбран раздел Меню Доставки "Плов"
      И заказан товар "Плов Чайханский"
      И открыта Корзина
      Тогда проверить в Корзине заказанные товары
      И проверить общую сумму в Корзине

      Когда очищена Корзина
      Тогда проверить что Корзина пуста